START_MESSAGE_TEXT = '''Здравствуйте! 🙌 

Сегодня нейросети все больше становятся частью нашей жизни, фундаментально её изменяя.

<b>BEATBOT</b> - это удобство и скорость. Сервис предлагает качественную генерацию треков в популярных стилях по доступной цене. 

У вас под рукой все инструменты для работы со звуком, позволяющие обойти необходимость использования десятков различных сайтов и сервисов.

Для начала работы вызовите <b>/menu</b>.'''

MENU_MESSAGE_TEXT = '<b>МЕНЮ</b>'
STYLES_MESSAGE_TEXT = 'Styles'
ABOUT_MESSAGE_TEXT = 'О нас'
RELOAD_MESSAGE_TEXT = 'Необходимо перезапустить бота командой /start'
BALANCE_FILL_MESSAGE = 'Введите сумму для оплаты'
ALERT_FILL_BALANCE = 'Введите корректные значения суммы пополнения!'

# FREE OPTIONS MESSAGES
SPEED_UP_MESSAGE = '''🆓 <b>SPEED UP</b>

Увеличить темп аудио

Поддерживаются файлы <b>.mp3</b>, <b>.wav</b>, <b>.ogg</b>, а также <b>голосовые сообщения</b>.'''

SLOW_DOWN_MESSAGE = '''🆓 <b>SLOW DOWN</b>

Замедлить темп аудио

Поддерживаются файлы <b>.mp3</b>, <b>.wav</b>, <b>.ogg</b>, а также <b>голосовые сообщения</b>.'''

MIDI_TO_WAV_MESSAGE = '''🔥 <b>МУЗЫКА ИЗ СВОИХ ЗВУКОВ</b>

<b>MIDI</b> – файл с набором инструкций для создания музыкальной композиции. 
Применялся в создании музыки для видеоигр и рингтонов для мобильных телефонов.

Вы можете создать свою музыку из файлов <b>.mp3</b>, <b>.wav</b>, <b>.ogg</b>, а также <b>голосовых сообщений</b>.

ℹ️ Скнитье midi и аудио файлы под сообщением.

Вы можете найти файл <b>.mid</b> вашей любимой музыки в интернете или в нашем канале по кнопкам ниже 👇'''

REMOVE_VOCAL_MESSAGE = '''🗣️ <b>REMOVE VOCAL</b>

Разделить аудио на <b>вокал</b> и <b>минус</b>.

Поддерживаются файлы <b>.mp3</b>, <b>.wav</b>.
'''

RHYMES_MESSAGE = '''🖇️ <b>РИФМЫ</b>

Подобрать рифмы к слову или словосочетанию.
Помогает в написании текстов для песен.'''

FIND_KEY_MESSAGE = '''🎼 <b>ОПРЕДЕЛИТЬ ТОНАЛЬНОСТЬ</b>

Поддерживаются файлы <b>.mp3</b>, <b>.wav</b>, <b>.ogg</b>, а также <b>голосовые сообщения</b>.'''

FIND_TEMPO_MESSAGE = '''🆓 <b>ОПРЕДЕЛИТЬ ТЕМП</b>

Определить темп аудио в <b>bpm</b>.

Поддерживаются файлы <b>.mp3</b>, <b>.wav</b>, <b>.ogg</b>, а также <b>голосовые сообщения</b>.
'''

NORMALIZE_SOUND_MESSAGE = '''🆓 <b>NORMALIZE SOUND</b>

Нормализовать громкость аудиофайла.

Поддерживаются файлы <b>.mp3</b>, <b>.wav</b>, <b>.ogg</b>, а также <b>голосовые сообщения</b>.'''

BASSBOOST_MESSAGE = '''🆓 <b>BASSBOOST</b>

Получить <b>bass boosted</b> версию аудио.

Поддерживаются файлы <b>.mp3</b>, <b>.wav</b>, <b>.ogg</b>, а также <b>голосовые сообщения</b>.'''
